In [1]:
import pandas as pd

df = pd.DataFrame({
    'Student': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Science': [89, 95, 76, 91, 84]
})

In [2]:
df

   Student  Science
0    Alice       89
1      Bob       95
2  Charlie       76
3    David       91
4      Eva       84

In [3]:
df['Science_Rank'] = df['Science'].rank(ascending=False)

In [6]:
df

   Student  Science  Science_Rank
0    Alice       89           3.0
1      Bob       95           1.0
2  Charlie       76           5.0
3    David       91           2.0
4      Eva       84           4.0

In [7]:
df1 = pd.DataFrame({
    'Player':['A','B','C','D'],
    'Score': [80,92,92,70]})

In [8]:
df1['Rank']=df1['Score'].rank(method='min',ascending=False)

In [9]:
df1

  Player  Score  Rank
0      A     80   3.0
1      B     92   1.0
2      C     92   1.0
3      D     70   4.0